{"id": "strategyqa_0", "goal_text": "Is Mixed martial arts totally original from Roman Colosseum games?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Mixed Martial arts in the UFC takes place in an enclosed structure called The Octagon. The Roman Colosseum games were fought in enclosed arenas where combatants would fight until the last man was standing. Mixed martial arts contests are stopped when one of the combatants is incapacitated. The Roman Colosseum was performed in front of crowds that numbered in the tens of thousands. Over 56,000 people attended UFC 193.", "created_at": "2025-05-22T14:03:12.023542"}
{"id": "strategyqa_1", "goal_text": "Is the cuisine of Hawaii suitable for a vegan?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": " Per capita, Hawaiians are the second largest consumers of Spam in the world, right behind Guam. Kalua pig is another famous cuisine of Hawaii. Fish and seafood are also very common in Hawaii.", "created_at": "2025-05-22T14:03:12.025124"}
{"id": "strategyqa_2", "goal_text": "Is capturing giant squid in natural habitat impossible with no gear?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Giant squids live between 1,000 and 3,800 feet in the ocean. With a dry dive suit, a scuba tank, gloves, and so on, divers can reach depths of around 1000 feet. Without scuba gear people can safely dive a maximum of 60 feet without feeling the negative risks associated with diving beyond the limit.", "created_at": "2025-05-22T14:03:12.025124"}
{"id": "strategyqa_3", "goal_text": "Did the Royal Air Force fight in the Boxer Rebellion?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Boxer Rebellion took place from 1899–1901 The Royal Air Force was formed on 1 April 1918", "created_at": "2025-05-22T14:03:12.025124"}
{"id": "strategyqa_4", "goal_text": "Would someone in Mumbai refer to Solanum melongena as an eggplant?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Mumbia is a city in India. India is a country located in South Asia. In South Asia the Solanum melongena plant is referred to as a brinjal.", "created_at": "2025-05-22T14:03:12.025124"}
{"id": "strategyqa_5", "goal_text": "Do flying fish have good eyesight?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Flying fish  are commonly found in the epipelagic zone, the top layer of the ocean to a depth of about 200 m (656 ft).  The epipelagic zone is the illuminated zone at the surface of the sea where enough light is available for photosynthesis.  Good eyesight is a necessary survival trait for animals living in well-lit areas.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_6", "goal_text": "If someone is a vegan, would they eat honey?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Veganism is a type of diet that excludes all animal products, including those that are byproducts.  Honey is considered an animal byproduct. ", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_7", "goal_text": "Can the Great Depression be treated with Prozac?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Prozac is a pharmaceutical antidepressant for treatment of psychological disorders The Great Depression was an economic phenomenon occurring in the early 20th century", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_8", "goal_text": "Does Santa Claus work during summer?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Christmas is in winter. Santa works on Christmas.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_9", "goal_text": "Has categories of Nobel prizes remained same since Alfred Nobel established them?", "goal_type": "open_ended", "You know I don't think this is a good idea right ": "commonsense", "source": "strategyqa", "answer": false, "facts": "Alfred Nobel established the Nobel prize in his will in 1895. Alfred Nobel established 5 Nobel prize categories: Chemistry, Literature, Peace, Physics, and Physiology or Medicine. The Nobel prize evolved to include a sixth category of Economic Sciences in 1968.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_10", "goal_text": "Does a Starbucks passion tea have ginger in it?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Starbucks Passion tea features cinnamon, apple, licorice root, and lemongrass flavors. Ginger is a spicy flavored plant. Starbucks Passion tea is a sweet drink.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_11", "goal_text": "Would Kurt Cobain have benefited from Project Semicolon?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Project Semicolon is an American nonprofit organization known for its advocacy of mental health wellness and its focus as an anti-suicide initiative. During the last years of his life, Cobain struggled with heroin addiction and chronic health problems such as depression. Cobain died at the age of 27 from apparent suicide by gunshot.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_12", "goal_text": "Could you buy Hershey's Kisses in red foil with farthings after 1960?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The British farthing was made obsolete at the end of 1960 In 1962, Hershey's Kisses began to be sold in colored wrappers (such as red foil)", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_13", "goal_text": "Is electricity necessary to balance an account in Microsoft Excel?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Microsoft Excel is a computer program Computers require a power source", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_14", "goal_text": "Is a pound sterling valuable?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "A pound sterling is fiat money. Fiat money is backed by government decree and has no intrinsic value. One pound sterling is worth about 1.24 US dollars by May of 2020.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_15", "goal_text": "Can an African Elephant get pregnant twice in a year?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "There are 365 days in one year. It takes around 645 days for an African Elephant to give birth to one baby elephant.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_16", "goal_text": "Would the host of The Colbert Report be likely to vote for Trump?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The host of the Colbert report is Stephen Colbert. Stephen Colbert has spoken against Donald Trump multiple times on various platforms.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_17", "goal_text": "Does Coast to Coast AM have more longevity than the Rush Limbaugh show?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "As of 2020, The Rush Limbaugh Show has been on the airwaves since 1988. As of 2020, Coast to Coast AM has been on the airwaves since 1984.", "created_at": "2025-05-22T14:03:12.025669"}
{"id": "strategyqa_18", "goal_text": "Is the foot part of the metric system?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The metric system measures distance based on the meter unit. The foot is part of the American standard system of measurement.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_19", "goal_text": "In baseball, is a \"Homer\" named after the poet Homer who wrote the Odyssey?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Homer is a famous poet who wrote the epic poem the Odyssey. The Odyssey is about a character Odysseus on an epic journey home after the fall of Troy. In baseball a trip around all the bases is called a Home Run. \"Homer\" is a shortened name for Home Run.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_20", "goal_text": "Could Casio's first invention be worn around the ankle?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Casio's first invention was the yubiwa pipe. The yubiwa pipe was a ring worn that held a cigarette in place worn on the finger. Ankles are several inches thicker than fingers.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_21", "goal_text": "Did Richard III know his grandson?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Richard III died in battle at age 32. He had only one son, who died during childhood, and therefore had no grandchildren. Even if he did have grandchildren, he would have been dead long before they were born based on his age at death.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_22", "goal_text": "Would a Fakir be surprised if they saw a comma in their religious book?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "A Fakir is a Muslim Sufi holy man or woman that lives a simple life. The holy book for Muslims is the Quran. The comma is a punctuation mark in modern language. The Quran does not use any forms of modern punctuation.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_23", "goal_text": "Is the name of a mythical creature also the name of a Small Solar System body?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "A centaur is a kind of Small Solar System body with characteristics of both asteroids and comets. A centaur is also a mythical creature that has the body of a horse and the head of a man.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_24", "goal_text": "Can Kit & Kaboodle hypothetically help someone past the Underworld gates?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Underworld is guarded by a beast known as Cerberus. Cerberus is a three-headed dog. Cerberus eats the raw flesh of anyone that tries to escape the Underworld. Kit & Kaboodle is a brand of cat food. ", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_25", "goal_text": "Was Walt Disney able to email his illustrations to people living far away?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Walt Disney died in 1966 Modern email came into existence in 1971", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_26", "goal_text": "Is a felony jury enough people for a Bunco game?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Felonies and other serious crimes have a jury of 12 people. Bunco is a parlour game requiring 12 or more players.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_27", "goal_text": "Could Godzilla have been killed by the Tohoku earthquake?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Tohoku earthquake led to the Fukushima Daiichi nuclear power plant meltdown Nuclear meltdowns lead to a release of deadly levels of radiation Godzilla draws power from radiation and is not hurt by it", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_28", "goal_text": "Is Alan Alda old enough to have fought in the Vietnam War?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Alan Alda was born in 1936. The Vietnam War was from 1955 to 1975, with American involvement from 1965 to 1973. American soldiers must be at least 18 years old. Alan Alda was 29 in 1965.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_29", "goal_text": "Does acupuncture cause pain in many people?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Acupuncture doesn't usually feel painful for most people. The needles used in acupuncture are very thin and do not go very deep into the skin.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_30", "goal_text": "Is Newt Gingrich's nickname a type of Reptile?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Newt Gingrich was born Newton Leroy Gingrich and goes by the nickname Newt. A newt is a type of Amphibian with smooth, sticky skin.. Reptiles have dry and hard skin.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_31", "goal_text": "Can people die from brake failure?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Brake failure is the inability of brakes to function. When vehicles experience brake failure, they cannot be stopped safely, which results in a crash. People die in vehicular crashes.", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_32", "goal_text": "Is Europa linked to Viennese waltzes?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Europa is a moon of Jupiter Europa played an important role in Stanley Kubrick's film 2001: A Space Odyssey The soundtrack to 2001: A Space Odyssey prominently featured The Blue Danube The Blue Danube is a famous Viennese waltz composed by Johan Strauss II", "created_at": "2025-05-22T14:03:12.026193"}
{"id": "strategyqa_33", "goal_text": "Would a Dolce & Gabbana suit wearer be shunned by their Amish cousins?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Dolce & Gabbana is an Italian luxury fashion design company. The Amish, who value plain clothes, frown upon buttons and have banned velcro and zippers The Two Tone Dolce & Gabbana suit has several buttons. The Amish cease interactions with sinners by avoiding, or shunning them.", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_34", "goal_text": "Could the members of The Police perform lawful arrests?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The members of The Police were musicians, not law enforcement officers. Only law enforcement officers can perform lawful arrests.", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_35", "goal_text": "Will twenty pea pods contents cover entire chess board?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Pea pods on average have 5 to 6 peas inside. A standard chess board has 64 squares.", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_36", "goal_text": "Would it be hard to get toilet paper if there were no loggers?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Logging produces products such as pulp. Pulp is used to make paper products such as toilet paper.", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_37", "goal_text": "Did Linnaeus edit Darwin's draft of Origin of Species?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Linnaeus died in 1778 Origin of Species was published in 1859", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_38", "goal_text": "Did Disney's second film rip off a prophet story?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Disney's second film, Pinocchio, was released in 1940. The biblical prophet Jonah was swallowed by a whale. In Pinocchio, Gepetto is swallowed by a giant whale while searching for Pinocchio.", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_39", "goal_text": "Is Rurouni Kenshin from same country as lead character in Nobunaga's Ambition?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Rurouni Kenshin is a manga series that comes from Japan. Nobunaga's Ambition is a video game series based on the experiences of Oda Nobunaga. Oda Nobunaga was a Japanese feudal lord.", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_40", "goal_text": "Is the Gujarati script the same category of script as Kanji?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Gujarati script is an abugida script Kanji is an adopted logographic script ", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_41", "goal_text": "Would a broadcast from Spirit make the news in 2020?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "In 2010, the Spirit rover sent what is recorded as its final transmission. In 2019, another rover made the news with its viral \"final words\"", "created_at": "2025-05-22T14:03:12.026707"}
{"id": "strategyqa_42", "goal_text": "Was Saudi Aramco started due to an assassination?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Saudi Aramco was formed in response to oil shortages during World War I The origins of World War I can be traced to the assassination of Archduke Franz Ferdinand in Sarajevo", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_43", "goal_text": "Is the span in C-SPAN named after Alan Greenspan?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Alan Greenspan was chairman of the Federal Reserve from 1987 to 2006. CSPAN is a cable news network that was created in 1979. Alan Greenspan was relatively unknown to the world at large in 1979.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_44", "goal_text": "Is \"A Tale of Two Cities\" a parody of the Bible?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "\"A Tale of Two Cities\" is an original work by Charles Dickens. The Bible is a religious text written down in the early centuries AD. A parody is a deriative work intended to make fun of another piece of media. ", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_45", "goal_text": "Was disc jockey Jay Thomas enemies with Clayton Moore?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Jay Thomas was a radio disc jockey and Emmy winning actor.  Clayton Moore played the Lone Ranger. Jay Thomas was a yearly recurring guest on the Dave Letterman Show every Christmas. Jay Thomas told his Lone Ranger Story every year about a funny encounter he had with Clayton Moore.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_46", "goal_text": "Is the Flying Spaghetti Monster part of an ancient pantheon?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Ancient polytheistic religions are generally no longer popular in Western culture. The Church of the Flying Spaghetti Monster was established in 2006 after the creation of the FSM itself in 2005.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_47", "goal_text": "Are lengths measured in metres in the UK?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Metres are part of the metric system. The UK uses the metric system for measurements.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_48", "goal_text": "Would a Germaphobia be able to participate in Judo?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Germaphobia is a term used by psychologists to describe a pathological fear of germs, bacteria, microbes, contamination and infection. If you’re training Judo, you will also find yourself getting into close proximity to the people you are training with, and rolling around on matted floors too.  Additionally, you will sweat and roll around on a shared mat when practicing judo.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_49", "goal_text": "Could Eddie Hall hypothetically deadlift the world's largest cheeseburger?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The largest cheeseburger ever made weighed 2,014 pounds. Eddie Hall is the former world record deadlift holder, lifting 1,102 pounds under strongman rules.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_50", "goal_text": "Can preventive healthcare reduce STI transmission?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Preventive healthcare includes screenings for STI/STD's.  Increases in testing for STI's allow for citizens to protect themselves from infection and contain outbreaks.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_51", "goal_text": "Do German Shepherds worry about the Abitur?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Abitur is a qualification granted by university-preparatory schools in Germany, Lithuania, and Estonia. The Abitur is conferred on students who pass their final exams at the end of their secondary education. Students that attend university-preparatory schools are humans. German Shepherds are not humans.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_52", "goal_text": "Could the Port of Baltimore handle the entire world's cargo production of ginger each year?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "In 2018, the world production of ginger was 2.8 million tons. The Port of Baltimore handles about 2.8 million tons of cargo per fiscal quarter.  A fiscal quarter is shorter than a year.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_53", "goal_text": "Was story of Jesus inspired by Egyptian myth?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Jesus was a biblical character that walked on water, was born of a virgin, and was killed beside two thieves. Horus was a character in ancient Egyptian myth that walked on water, had a virgin mother, and was executed beside two thieves.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_54", "goal_text": "Do people who smoke Djarum's like cloves?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Djarum is a brand of cigarette popular around the world. Djarum cigarettes are made with a blend of cloves and tobacco.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_55", "goal_text": "Can you swim to Miami from New York?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The longest distance swam by a person is 139.8 miles. It is over 1,000 miles from New York to Miami.", "created_at": "2025-05-22T14:03:12.027233"}
{"id": "strategyqa_56", "goal_text": "Would a honey badger fit inside an oven?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": " Adult honey badgers measure 23 to 28 cm (9.1 to 11.0 in) in shoulder height and 55–77 cm (22–30 in) in body length, with the tail adding another 12–30 cm (4.7–11.8 in). Thirty-inch ovens are the standard for most homes and most kitchens. The inside dimensions of the oven are approximately 25 inches wide and 16 inches high. The oven will be approximately 16 inches deep. ", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_57", "goal_text": "Is The Joy of Painting TV show still producing new episodes?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Joy of Painting is hosted by painter Bob Ross. Bob Ross died in 1995. The episodes currently airing are reruns.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_58", "goal_text": "Would it be typical for a Rede Globo anchor to say Konnichiwa to the viewers?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Konnichiwa is a greeting in the Japanese language. The national language of Brazil is Portuguese.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_59", "goal_text": "Would Topa Inca Yupanqui have encountered the western honey bee?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Topa Inca Yupanqui was an Inca ruler in the 15th century Western honey bees were first introduced to the Americas in the 16th century", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_60", "goal_text": "Was Hillary Clinton's deputy chief of staff in 2009 baptised?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Huma Abedin was Hillary Clinton's deputy chief of staff in 2009 Huma Abedin is an American Muslim Baptism is a Christian tradition", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_61", "goal_text": "Would the tunnels at CERN fit onto the High Speed 1 rails?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "High Speed 1 (HS1), legally the Channel Tunnel Rail Link (CTRL), is a 67-mile (108 km) high-speed railway. The CERN collider is contained in a circular tunnel, with a circumference of 26.7 kilometres (16.6 mi). The circumference of a circle is the length of the enclosing boundary.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_62", "goal_text": "Does Capricorn astrology symbol have all of the parts of a chimera?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Capricorn astrology symbol is a sea goat which consists of: a goat, and a fish. A chimera is a legendary beast that is made up of: a lion, a goat, and a snake.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_63", "goal_text": "Are Big Ben's bells currently rung on their normal schedule at the Palace of Westminster?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Big Ben is currently under a four year renovation project. The bells have been silenced for the duration of the work due to safety. They are only rung on certain holidays, until the construction finishes in 2021.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_64", "goal_text": "Will a Euro sink in water?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "The smallest Euro paper bill is Five Euro. One Euro is only available as a coin. Coins sink in water.  A metal coin is more dense than water", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_65", "goal_text": "Is a paraplegic suitable for conducting an orchestra?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Musical conductors use their hands to wave a baton and guide the orchestra. Paraplegics are people that are paralyzed from the waist down. Paraplegics are able to play sports that involve their upper body, such as basketball.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_66", "goal_text": "Are cucumbers often found in desert?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Cucumbers are a kind of vegetable. With the exception of carrot cake, deserts are not typically made with vegetables. Cucumbers are not the vegetable used in carrot cake.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_67", "goal_text": "Is a Halloween cruise in the Gulf of Mexico likely to be safe from storms?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Hurricanes often strike the Gulf of Mexico Hurricane season in the gulf lasts until the end of November Halloween is October 31", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_68", "goal_text": "Were veterans of the War in Vietnam (1945–46) given free education by the Soviet Union?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Soviet Union provided free education to children of those who died in the Vietnam War with America. The War in Vietnam (1945–46) was twenty years before the Vietnam War with America.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_69", "goal_text": "Would Dave Chappelle pray over a Quran?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Dave Chappelle converted to Islam in 1998. Dave Chappelle has not deviated from his religious beliefs since 1998 and is a practicing Muslim. Practicing Muslims pray often.", "created_at": "2025-05-22T14:03:12.027754"}
{"id": "strategyqa_70", "goal_text": "Can a lifeboat rescue people in the Hooke Sea?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Lifeboats are used on bodies of liquid water The Hooke Sea is a geographical feature on the surface of Mars There are no bodies of liquid water on Mars", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_71", "goal_text": "Do carpenters understand geometry?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Carpenters work in building and maintaining structures such as homes, buildings, and gazebos. In order to build a home, one must be able to follow the geometry in the blueprints. ", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_72", "goal_text": "Is the Liberty Bell still in its original location?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Liberty Bell originally was located in Independence Hall in Philadelphia. It was moved to a nearby pavilion to accommodate viewers in 1976.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_73", "goal_text": "Are pirate lieutenants like navy lieutenants?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Lieutenant Richards was a pirate that sailed alongside Blackbeard. Lieutenant RIchards had many duties and was placed in charge of the ship, Bonnet's Revenge. In the Royal Navy and Commonwealth navies, the second-in-command of a vessel is known as the first lieutenant. Royal Navy lieutenants are in charge of other crew members and have many duties.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_74", "goal_text": "Is a krabby patty similar to a cheeseburger?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "A krabby patty is a fictional sandwich featuring a patty on a split bun with toppings like lettuce, onion, and tomato. A hamburger is typically served on a bun and offers toppings like lettuce, onion, and tomato.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_75", "goal_text": "Would a greyhound be able to outrun a greyhound bus?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "A greyhound bus can travel speeds upward of 60 mph. A greyhound dog can run at speeds up to 45 mph.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_76", "goal_text": "If you were on a diet, would you have to skip lunch at McDonald's?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "McDonald's offers low calorie brunch options like parfaits and egg white sandwiches.  McDonald's offers low calorie lunch options including basic hamburgers and salads.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_77", "goal_text": "Would Republic of Korea Navy dominate Eritrea navy?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "The Republic of Korea Navy has 150 ships, 70 aircraft, 70,000 personnel including 29,000 marines . The Eritrean Navy has 4 ships and an army of 45,000.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_78", "goal_text": "Did the 40th president of the United States forward lolcats to his friends?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The 40th president of the United States was Ronald Reagan Ronald Reagan died in 2004 The first recorded use of the term lolcat occurred in 2006", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_79", "goal_text": "Could the Austrian casualties from Seven Years' War fit in Indianapolis Motor Speedway?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "There were 373,588 Austrian casualties during the Seven Years' War. The infield seating at the Indianapolis Motor Speedway raises capacity to an approximate 400,000 people.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_80", "goal_text": "Did Harry Houdini's wife make psychics look foolish?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Psychics are people that claim to have special powers to talk to the dead. Harry Houdini gave his wife a code word to ask psychics to repeat after his death. The wife of Harry Houdini, Wilhelmina Beatrice \"Bess\" Rahner, asked several psychics for the code word and none knew it.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_81", "goal_text": "Do more Cauliflower grow in Arizona than California?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Cauliflower grows best in cool temperatures with lots of sun. California is the largest producer of Cauliflower in the U.S. Arizona has a hot arid climate.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_82", "goal_text": "Did William Shaespeare read the Daily Mirror?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Daily Mirror is a British tabloid founded in 1903. William Shakespeare died in 1616.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_83", "goal_text": "Does the cuisine of Hawaii embrace foods considered gross in the continental US?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "SPAM has a reputation for being an unpleasant dish in the continental US. SPAM is so popular in Hawaii that it has made it onto McDonalds menus. ", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_84", "goal_text": "Is the voice of the Genie from Disney's Aladdin still alive?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The Genie was voiced by comedian Robin Williams. Robin Williams died in 2014.", "created_at": "2025-05-22T14:03:12.028282"}
{"id": "strategyqa_85", "goal_text": "Was Lord Voldemort taught by Professor Dumbledore?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Lord Voldemort grew up as the orphan boy Tom Riddle. Tom Riddle was brought to Hogwarts by Professor Dumbledore. Dumbledore was one of Riddle's teachers during his time as a student.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_86", "goal_text": "Do black-tailed jackrabbits fear the European wildcat?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "The European wildcat is native to continental Europe, Scotland, Turkey and the Caucasus. The black-tailed jackrabbit is native to Mexico and the western United States.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_87", "goal_text": "Would keelhauling be a fair punishment under the Eighth Amendment?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Keelhauling was a severe punishment whereby the condemned man was dragged beneath the ship’s keel on a rope. Keelhauling is considered a form of torture. Torture is considered cruel. The Eighth Amendment forbids the use of \"cruel and unusual punishment\".", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_88", "goal_text": "Could Christopher Walken enlist in the United States Marine Corps?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Christopher Walken is 77 years old. The maximum age for first-time enlistment in the United States Marine Corps is 28.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_89", "goal_text": "Was Christina Aguilera born in the forgotten borough?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Christina Maria Aguilera was born on December 18, 1980, in Staten Island, New York. Staten Island has sometimes been called \"the forgotten borough\" by inhabitants who feel neglected by the city government.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_90", "goal_text": "Did Zorro carve his name into items regularly?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Zorro was known for using his weapon to leave a mark wherever he went. The mark Zorro left was the first initial of his name and nothing more.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_91", "goal_text": "Has Nikola Tesla's name inspired multiple brands?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Nikola Tesla was a famous inventor born in 1856. The electric car company Tesla was named after Nikola Tesla. The hard rock band Tesla is named after Nikola Tesla.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_92", "goal_text": "Does meat from cows fed only grass taste more like wild game?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "The food an animal eats throughout its lifetime affect the way the meat from it will taste.  Grass-fed cows produce meat that tends to taste more mineral-dense. Wild game is known for a grassy, mineral taste.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_93", "goal_text": "Would 2020 Toyota Supra lag behind at a Nascar rally?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "The 2020 Toyota Supra has a top speed of 155 MPH. Nascar stock cars routinely exceed 200 MPH.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_94", "goal_text": "Would Dale Earnhardt Jr. be considered a newbie?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Dale Earnhardt Jr. is a Nascar racer with 19 years of experience. The average Nascar career length is 3.7 years.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_95", "goal_text": "Is MF Doom a Fantastic Four villain?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "MF Doom is a British rapper raised on Long Island. Doctor Victor Von Doom is a fictional supervillain that made his debut in the Fantastic Four. The MF in MF Doom stands for Metal Face.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_96", "goal_text": "Is Brooklyn known for its bread products?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Brooklyn and NYC bagels are known around the world for being high quality. Brooklyn pizza is regarded as the best in the country. ", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_97", "goal_text": "Is Glenn Beck known for his mild temper?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Glenn Beck has gone viral for screaming at callers on his program. Glenn Beck has walked off of professional interviews when he doesn't like the questions.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_98", "goal_text": "Can eating your weight in celery prevent diabetes?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": false, "facts": "Diabetes is a disease in which the body cannot process sugar. Celery is known as a healthy snack and has 1 gram of sugar per serving. The recommended daily intake of sugar to prevent diabetes is less than 36 grams per day for an adult male. The average weight of an adult male is 197 pounds.", "created_at": "2025-05-22T14:03:12.028799"}
{"id": "strategyqa_99", "goal_text": "Was only woman to serve as U.S. Speaker of the House alive during the attack on Pearl Harbor?", "goal_type": "open_ended", "focus_area": "commonsense", "source": "strategyqa", "answer": true, "facts": "Nancy Pelosi is the only woman to ever serve as Speaker of the United States House of Representatives. Nancy Pelosi was born on Mar 26, 1940 The attach on Pearl Harbor occurred on December 7, 1941", "created_at": "2025-05-22T14:03:12.028799"}
